; domain
(define (domain robot-domain)

(:requirements :strips)

(:predicates (robot ?r)(person ?p)(level ?l)(image ?im)(level_image ?l ?im)(shown_image ?im)
             (wait_status ?r)(face_detected ?p)(keyword_detected ?w)(known_person ?p)(data_inserted ?p)
             (person_ready ?p)(reg_completed ?p)(session_on ?r ?p)
             (level_started ?l)(level_completed ?l)(prec ?l1 ?l2)(first_level ?l)
             (mark_assigned ?l)(all_levels_completed ?p)(different ?l1 ?l2)(talk ?r ?p)
)

(:action wait
    :parameters (?p)
    :precondition (and(person ?p)(not(talk R P)))
    :effect (wait_status R)
)

(:action detect_face
    :parameters (?p)
    :precondition (and (person ?p)(not(face_detected ?p))(not(talk R P))
                  (or (wait_status R)(keyword_detected HELLO)))
    :effect (and(face_detected ?p)(not(wait_status R)))
)

(:action listen
    :parameters (?p)
    :precondition (and(person ?p)(not(keyword_detected HELLO))(not(talk R P))
                  (or (wait_status R)(face_detected ?p)))
    :effect (keyword_detected HELLO)
)

(:action insert_data
    :parameters (?p)
    :precondition (and (person ?p)(face_detected ?p)(keyword_detected HELLO)
                  (not (data_inserted ?p))(talk R P))
    :effect (and(data_inserted ?p)(not(talk R ?p)))
)

(:action complete_registration
    :parameters (?p)
    :precondition (and (person ?p)(data_inserted ?p)(not (known_person ?p))(not (reg_completed ?p))(not(talk R P)))
    :effect (and (reg_completed ?p))
)

(:action store_data
    :parameters (?p)
    :precondition (and (person ?p)(data_inserted ?p)(reg_completed ?p)(not (person_ready ?p))(not(talk R P)))
    :effect (person_ready ?p)
)

(:action recover_data
    :parameters (?p)
    :precondition (and (person ?p)(known_person ?p)(data_inserted ?p)(not (reg_completed ?p))(not (person_ready ?p))(not(talk R P)))
    :effect (person_ready ?p)
)

(:action start_session
    :parameters (?p ?l)
    :precondition (and (person ?p)(person_ready ?p)(not (session_on R ?p))
                  (level ?l)(first_level ?l)(not (level_started ?l))(talk R ?p))
    :effect (and (session_on R ?p)(level_started ?l)(not(talk R P)))
)

(:action show_image
    :parameters (?l ?im)
    :precondition (and (level ?l)(level_started ?l)(image ?im)(level_image ?l ?im)(not (shown_image ?im)))
    :effect (shown_image ?im)
)

(:action assign_mark
    :parameters (?im)
    :precondition (and (image ?im)(shown_image ?im)(not (mark_assigned ?im)))
    :effect (and (mark_assigned ?im)(not(talk R P)))
)

(:action check_level
    :parameters (?l ?im1 ?im2)
    :precondition (and (level ?l)(level_image ?l ?im1)(level_image ?l ?im2)(different ?im1 ?im2)
                  (mark_assigned ?im1)(mark_assigned ?im2)(not(level_completed ?l)))
    :effect (level_completed ?l)
)

(:action next_level
    :parameters(?l1 ?l2)
    :precondition (and (level ?l1)(level ?l2)(prec ?l1 ?l2)(level_completed ?l1)
                  (not (level_started ?l2))(talk R P))
    :effect (and(level_started ?l2)(not(talk R P)))
)

(:action end_session
    :parameters (?p)
    :precondition (and (person ?p)(level_completed L1)(level_completed L2)(talk R ?p))
    :effect (all_levels_completed ?p)
)

(:action interact
    :parameters (?p)
    :precondition (person ?p)
    :effect (talk R ?p)
)

)

; problem
(define (problem robot-problem)

	(:domain robot-domain)

	(:objects R P HELLO L1 L2 IM1 IM2 IM3 IM4 )

	(:init (robot R)(person P)(level L1)(level L2)
	       (image IM1)(image IM2)(image IM3)(image IM4)
	       (different IM1 IM2)(different IM1 IM3)(different IM1 IM4)
	       (different IM2 IM3)(different IM2 IM4)(different IM3 IM4)
	       (different L1 L2)
	       (first_level L1)(prec L1 L2)
	       (level_image L1 IM1)(level_image L1 IM2)
	       (level_image L2 IM3)(level_image L2 IM4)
	       (known_person P)
	)
	
	(:goal (and(not(wait_status R))(face_detected P)(keyword_detected HELLO)
	           (person_ready P)(all_levels_completed P) ) )
	
)

; plan
1. (wait p)
   added: (wait_status r)
   goals met: 0 of 5
2. (detect_face p)
   deleted: (wait_status r)
   added: (face_detected p)
   goals met: 2 of 5
3. (listen p)
   added: (keyword_detected hello)
   goals met: 3 of 5
4. (interact p)
   added: (talk r p)
   goals met: 3 of 5
5. (insert_data p)
   deleted: (talk r p)
   added: (data_inserted p)
   goals met: 3 of 5
6. (recover_data p)
   added: (person_ready p)
   goals met: 4 of 5
7. (interact p)
   added: (talk r p)
   goals met: 4 of 5
8. (start_session p l1)
   deleted: (talk r p)
   added: (session_on r p) (level_started l1)
   goals met: 4 of 5
9. (show_image l1 im2)
   added: (shown_image im2)
   goals met: 4 of 5
10. (assign_mark im2)
   added: (mark_assigned im2)
   goals met: 4 of 5
11. (show_image l1 im1)
   added: (shown_image im1)
   goals met: 4 of 5
12. (assign_mark im1)
   added: (mark_assigned im1)
   goals met: 4 of 5
13. (interact p)
   added: (talk r p)
   goals met: 4 of 5
14. (check_level l1 im1 im2)
   added: (level_completed l1)
   goals met: 4 of 5
15. (next_level l1 l2)
   deleted: (talk r p)
   added: (level_started l2)
   goals met: 4 of 5
16. (show_image l2 im4)
   added: (shown_image im4)
   goals met: 4 of 5
17. (assign_mark im4)
   added: (mark_assigned im4)
   goals met: 4 of 5
18. (show_image l2 im3)
   added: (shown_image im3)
   goals met: 4 of 5
19. (assign_mark im3)
   added: (mark_assigned im3)
   goals met: 4 of 5
20. (interact p)
   added: (talk r p)
   goals met: 4 of 5
21. (check_level l2 im3 im4)
   added: (level_completed l2)
   goals met: 4 of 5
22. (end_session p)
   added: (all_levels_completed p)
   goals met: 5 of 5
